Процедура ЗаполнитьТаблицуРолей() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	RightList.Очистить();
	НаборПрав = Метаданные.Роли;
	
	Для Каждого Роль Из НаборПрав Цикл
		
		СтрокаРоли = RightList.Добавить();
		СтрокаРоли.RuleName = Роль.Имя;
		СтрокаРоли.RuleView = Роль.Синоним;
		СтрокаРоли.On = Пользователь.Роли.Содержит(Роль);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если Пользователь = Неопределено ТОгда
		
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = Наименование;
		Пользователь.ПолноеИмя = FullName;
		
	КонецЕсли;	
	СписокРолей = RightList.НайтиСтроки(Новый Структура("On",Истина));
	Для Каждого Роль Из СписокРолей Цикл
		
		Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Роль.RuleName));
		
	КонецЦикла;	 
КонецПроцедуры
